["Tell me about yourself.", "What are your strengths?", "What are your weaknesses?", "Why do you want this job?", "Why should we hire you?", "What did you like least about your last job?", "Why are you leaving your present job?", "What do you know about our company?", "Do you have any questions for me?", "Tell me about a time when you had to give someone difficult feedback. How did you handle it?", "What is your greatest failure, and what did you learn from it?", "What's the most difficult decision you've made in the last two years and how did you come to that decision?", "What salary are you seeking?", "What kind of goals would you have in mind if you got this job?", "What do you see yourself doing within the first 30 days of this job?", "How would you describe your work style?", "What would be your ideal working environment?", "Tell me about your proudest achievement.", "Who was your favorite manager and why?", "What are three positive things your last boss would say about you?", "What negative thing would your last boss say about you?", "What three character traits would your friends use to describe you?", "What are three positive character traits you don't have?", "What is your greatest achievement outside of work?", "Tell me one thing about yourself you wouldn't want me to know.", "What's the last book you read?", "How would you weigh a plane without a scale?", "What type of work environment do you prefer?", "How do you deal with pressure or stressful situations?", "What are your salary expectations?", "Walk me through your resume.", "Why do you want to work at this company?", "What are your greatest strengths?", "What do you consider to be your weaknesses?", "What is your greatest professional achievement?", "Tell me about a challenge or conflict you’ve faced at work, and how you dealt with it.", "Why are you leaving your current job?", "What’s your current salary?", "What are you looking for in a new position?", "What’s your work style?", "How would your boss and coworkers describe you?", "How do you prioritize your work?", "What motivates you?", "Where do you see yourself in five years?", "How do you plan to achieve your career goals?", "What are your career aspirations?", "What’s your dream job?", "How many tennis balls can you fit into a limousine?", "Do you have any questions for us?", "Tell me something about yourself.", "Why do you want to work here?", "Why did you decide to apply for this position?", "What is your greatest strength?", "What are your strengths and weaknesses?", "What do you know about this company/organization?", "What is your greatest accomplishment?", "What are your salary requirements?", "What are you looking for from a new position?", "What kind of working environment do you work best in?", "Where do you see yourself in 5 years?", "Why did you decide to leave your previous/current job?", "How would your boss describe you?", "How do you deal with pressure or stressful situation?", "Give an example of how you have handled a challenge in the workplace before.", "Can you walk us through your resume?", "Why is our company interesting to you?", "What is your greatest personal achievement?", "Where do you see yourself in 10 years?", "What do you know about our industry?", "Describe a time you went above and beyond at work.", "What do you want to accomplish in the first 30 days of this job?", "Describe a time when you had to give a person difficult feedback.", "Tell me about how you dealt with a difficult challenge in the workplace.", "What is your ideal working environment?", "What are some positive things your last boss would say about you?", "What character traits would your friends use to describe you?", "What is your proudest achievement?", "What’s the last book you read?", "What is the best job you ever had?", "What was your greatest failure, and what did you learn from it?", "What’s the biggest lesson you’ve learned from a mistake you’ve made?", "What is one negative thing your last boss might say about you?", "Describe your work style.", "Tell me about yourself", "How would you describe yourself?", "What are your greatest weaknesses?", "What are your goals for the future?", "Can you tell me about a difficult work situation and how you overcame it?", "What is your salary range expectation?", "Do you have any questions?", "What did you like most about your last position?", "What did you like least about your last position?", "How do you handle stress?", "What is your dream job?", "Why are you interested in this position?", "Tell me a little about yourself.", "What are your biggest weaknesses?", "What are your biggest strengths?", "Out of all the candidates, why should we hire you?", "Describe your dream job.", "Why do you want to leave your current job?", "What kind of work environment do you like best?", "Tell me about the toughest decision you had to make in the last six months.", "Tell me how you think other people would describe you.", "What questions do you have for me?", "Where do you see yourself in 5 years? 10 years?", "Why do you want to leave your current company?", "Tell me about an accomplishment you are most proud of.", "What would you look to accomplish in the first 30 days/60 days/90 days on the job?", "Describe yourself.", "Tell me how you handled a difficult situation.", "Why are you looking for a new job?", "What was your biggest failure?", "How do you handle pressure?", "What are your career goals?", "What were your bosses’ strengths/weaknesses?", "What was the last book you’ve read for fun?", "Would you work 40+ hours a week?", "What is your greatest weakness?", "How will your greatest strength help you perform?", "How do you handle stress and pressure?", "How would your co-workers describe your personality?", "Why are you leaving your job?", "Why do you want to change jobs?", "Why did you quit your job?", "Why shouldn't we hire you?", "What strength will help you the most to succeed?", "What have you learned from your mistakes?", "What did you like or dislike about your previous job?", "Describe a difficult work situation or project and how you overcame it.", "Describe your ideal boss.", "What do you know about this company?", "What do you know about this company? (for sales jobs)", "What do you see yourself doing within the first 30 days on the job?", "What are you looking for in your next job? What is important to you?", "Where do you see yourself five years from now?", "What’s your greatest weakness?", "What’s your greatest strength?", "What’s your greatest accomplishment?", "Why do you want to work for us?", "Why did you leave your last job?", "What’s the most recent book you’ve read?", "If you could describe yourself in two words what would they be?", "What is your ideal job?", "How would you describe your personality?", "What did you hate about your last job?", "Tell me about your proudest professional accomplishment.", "Tell me about a time when you went above or beyond?", "Tell me about a time you provided excellent customer service", "Have you ever taken on a leadership role voluntarily? If so, can you tell me about it?", "Which of your past managers was your favorite leader, and why?", "Describe how you motivate others", "Where do you see yourself in five years? Ten years?", "What attracted you to apply for this position?", "How would your colleagues describe you?", "What motivates you to work?", "Name a work accomplishment that makes you proud?", "Why do you plan on leaving your current employer?", "How would your current boss describe you?", "Where do you see yourself in the next 5 years?", "Tell me about your strengths.", "Tell me about your weaknesses.", "Why are you interested in working here?", "What's your greatest strength?", "What's your greatest weakness?", "What salary range are you looking for?", "Tell me about a major challenge you’ve faced at work and how you overcame it.", "Tell me about a failure you experienced and how you handled it.", "Why did you apply for this position?", "Why are you looking to leave your current company?", "Tell us about a challenge you’ve faced and how you handled it", "What is your greatest achievement?", "What is your desired salary?", "What would be your ideal work environment?", "What techniques do you use to manage stress?", "What are three positive things your former boss will say about you?", "Would your former boss have anything negative to say about you?", "What was the last book you read?", "Can you tell me about a time you went above and beyond what was expected of you at work?", "What is the most difficult decision you have made in the last three years?", "Tell me about a time you made a mistake or failed at something. What did you learn from this experience? Can you give me two other examples?", "What are your strengths? Your weaknesses?", "What are your longer-term career goals (or where do you see yourself in 5 or 10 years)?", "What made you apply for this position?", "Can you describe for me one or two of your most important accomplishments?", "What are you leaving your present job? Or why did you leave your last job?", "What would you say is the most important thing you are looking for in a job?", "What were some of the things about your last job that you found most difficult to do?", "How would you describe yourself as a person?", "What do you consider to be your greatest achievements to date? Why?", "What was your most difficult decision in the last six months? What made it difficult?", "What is your professional goal?", "What’s something positive your boss would say about you?", "Why are you leaving your current role?", "What are your future goals?", "Describe a difficult work situation on how you overcame it", "Can you tell me a little about yourself?", "What’s the accomplishment you feel proudest about?", "What is your biggest weakness?", "Why should I hire you?", "What would your last boss say about you?", "Tell me about yourself?", "What are your major strengths?", "What are your major weaknesses?", "What are your major accomplishments?", "Where do you see yourself in the future – in 5 years, 10 years etc?", "What are you looking for in a job?", "What did you like most about your last job?", "What didn’t you like about your last job?", "What is your greatest career achievement?", "Which of your former jobs did you like most and why?", "Why are you applying for this job?", "Why do you want to work for this company?", "How would you describe your working style?", "What is your biggest mistake at work and what did you learn?", "What is the greatest challenge you have faced at work?", "How do you prioritize tasks?", "How would your former boss describe you?", "Do you have any questions for me/us?", "What are your expectations for salary?", "Where do you see yourself in five years? 10 years?", "Tell me about an accomplishment you are most proud of", "What were your boss’ strengths/weaknesses?", "If I were to ask one of your professors (or a boss) to describe you, what would he or she say?", "What goals do you have in your career?", "What accomplishments have given you the most satisfaction in your life?", "What are your short-term goals?", "What would your past manager say about you?", "Do you handle pressure well?", "What kind of salary are you seeking?", "What is the one word that describes you best?", "What is most important to you in your job?", "What is the title of the most recent book you have read?", "Tell me about the hardest decision you have ever had to make.", "How would you describe your personal work style?"]